Tekla.Structures.PluginsInternal.ICDelegate


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetPluginBaseDirectory(Tekla.Structures.Internal.dotPluginBaseDirectory_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetPluginName(Tekla.Structures.Internal.dotPluginName_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetPluginId


Tekla.Structures.PluginsInternal.ICDelegate.ExportSetPluginResult(System.Int32)


Tekla.Structures.PluginsInternal.ICDelegate.ExportExecutePluginResult(System.Int32)


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportSetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetPluginIntAttributes(Tekla.Structures.Internal.dotPluginAttributesInt_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetPluginDoubleAttributes(Tekla.Structures.Internal.dotPluginAttributesDouble_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetPluginStringAttributes(Tekla.Structures.Internal.dotPluginAttributesString_t@)


Tekla.Structures.PluginsInternal.ICDelegate.DrawingExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@)


Tekla.Structures.PluginsInternal.ICDelegate.DrawingExportGetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.ICDelegate.DrawingExportSetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.ICDelegate.DrawingExportCurrentDefineInputClientId(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.ICDelegate.DrawingExportDefineInputCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.ICDelegate.DrawingExportPluginRunCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@,Tekla.Structures.Internal.dotConnectionType_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportGetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportSetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.ICDelegate.ExportSignalInputEnded
